Lenti84/VdMot_Controller/software_esp32/src/web.cpp
/**HEADER*******************************************************************
  project : VdMot Controller

  author : SurfGargano, Lenti84

  Comments:

  Version :

  Modifcations :


***************************************************************************
*
* THIS SOFTWARE IS PROVIDED "AS IS" AND ANY EXPRESSED OR
* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
* OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
* IN NO EVENT SHALL THE DEVELOPER OR ANY CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
* STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
* IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
* THE POSSIBILITY OF SUCH DAMAGE.
*
**************************************************************************
  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License.
  See the GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program.  If not, see <http://www.gnu.org/licenses/>.

  Copyright (C) 2021 Lenti84  https://github.com/Lenti84/VdMot_Controller

*END************************************************************************/



#include "globals.h"
#include "web.h"
#include "stm32.h"
#include "stm32ota.h"
#include "app.h"
#include <SPIFFS.h>
#include <FS.h>
#include "TypedQueue.h"
#include "VdmNet.h"
#include "VdmConfig.h"

String ip2String (IPAddress ipv4addr)
{
  return ipv4addr.toString();
}

String getNetConfig (VDM_NETWORK_CONFIG netConfig)
{
  String result = "{\"ethWifi\":"+String(netConfig.eth_wifi)+","+
                  "\"dhcp\":"+String(netConfig.dhcpEnabled)+","+
                  "\"ip\":\""+ip2String(netConfig.staticIp)+"\","+
                  "\"mask\":\""+ip2String(netConfig.mask)+"\","+
                  "\"gw\":\""+ip2String(netConfig.gateway)+"\","+
                  "\"dns\":\""+ip2String(netConfig.dnsIp)+"\","+
                  "\"userName\":\""+String(netConfig.userName)+"\","+
                  "\"ssid\":\""+String(netConfig.ssid)+"\","+
                  "\"timeServer\":\""+String(netConfig.timeServer)+"\","+
                  "\"timeOffset\":"+String(netConfig.timeOffset)+","+
                  "\"timeDST\":"+String(netConfig.daylightOffset)+
                  "}";  
  return result;  
}

String getNetInfo(ETHClass ETH,VDM_NETWORK_CONFIG netConfig)
{
  String result = "{\"ethWifi\":"+String(VdmNet.interfaceType)+","+
                  "\"dhcp\":\""+String(netConfig.dhcpEnabled)+"\","+
                  "\"ip\":\""+ETH.localIP().toString()+"\","+
                  "\"mac\":\""+ETH.macAddress()+"\","+
                  "\"mask\":\""+ETH.subnetMask().toString()+"\","+
                  "\"gw\":\""+ETH.gatewayIP().toString()+"\","+
                  "\"dns\":\""+ETH.dnsIP().toString()+"\"}";
  return result;  
}

String getProtConfig (VDM_PROTOCOL_CONFIG protConfig)
{
  String result = "{\"prot\":"+String(protConfig.dataProtocol)+","+
                    "\"mqttIp\":\""+ip2String(protConfig.brokerIp)+"\","+
                    "\"mqttPort\":"+String(protConfig.brokerPort)+"}";  
  return result;  
}

String getValvesConfig (VDM_VALVES_CONFIG valvesConfig)
{
  String result = "{\"calib\":{\"dayOfCalib\":"+String(valvesConfig.dayOfCalib) + "," +
                  "\"hourOfCalib\":"+String(valvesConfig.hourOfCalib) + "},\"valves\":[" ;

  for (uint8_t x=0;x<ACTUATOR_COUNT;x++) {
    result += "{\"name\":\""+String(valvesConfig.valveConfig[x].name) + "\"," +
              "\"active\":"+String(valvesConfig.valveConfig[x].active) + "}";
    if (x<ACTUATOR_COUNT-1) result += ",";
  }  
  result += "]}"; 
  return result;  
}

String getTempsConfig (VDM_TEMPS_CONFIG tempsConfig)
{
  String result = "[";
  
  for (uint8_t x=0;x<ACTUATOR_COUNT;x++) {
    result += "{\"name\":\""+String(tempsConfig.tempConfig[x].name) + "\"," +
              "\"active\":"+String(tempsConfig.tempConfig[x].active) + "," +
              "\"offset\":"+String(((float)tempsConfig.tempConfig[x].offset)/10,1) + "}";
    if (x<ACTUATOR_COUNT-1) result += ",";
  }  
  result += "]"; 
  return result;  
}


String getSysInfo()
{
  struct tm timeinfo;
  char buf[50];
  String time;
 
  if(!getLocalTime(&timeinfo)){
    time = "Failed to obtain time";
  } else {
    strftime (buf, sizeof(buf), "%A, %B %d.%Y %H:%M:%S", &timeinfo);
    time = String(buf);
  }
  String result = "{\"wt32version\":\""+String(MAJORVERSION)+"."+String(MINORVERSION)+"\","+
                  "\"locTime\":\""+time+"\"}";
  return result;  
}

String getValvesStatus() 
{
  String result = "[";
  for (uint8_t x=0;x<ACTUATOR_COUNT;x++) {
    
    result += "{\"pos\":"+String(actuators[x].actual_position) + ","+
              "\"meanCur\":" + String(actuators[x].meancurrent) + ","+
              "\"targetPos\":" + String(actuators[x].target_position)+"}";      
    if (x<ACTUATOR_COUNT-1) result += ",";
  }  
  result += "]";
  return result;
}


String getTempsStatus(VDM_TEMPS_CONFIG tempsConfig) 
{
  String result = "[";
  int temperature;
  for (uint8_t x=0;x<ACTUATOR_COUNT;x++) {
    temperature = actuators[x].temperature+tempsConfig.tempConfig[x].offset;
    result += "{\"temp\":" + String(((float)temperature)/10,1)+"}";
    if (x<ACTUATOR_COUNT-1) result += ",";
  }  
  result += "]";
  return result;
}
